tjd61/cc2650_simplelink_ble/ti/simplelink_academy_01_11_00_0000/modules/projects/support_files/Components/SCIF_UART/scif.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/// \addtogroup module_scif_driver_setup
//@{
#include "scif.h"
#include "scif_framework.h"
#include <inc/hw_types.h>
#include <inc/hw_memmap.h>
#include <inc/hw_aon_event.h>
#include <inc/hw_aon_rtc.h>
#include <inc/hw_aon_wuc.h>
#include <inc/hw_aux_sce.h>
#include <inc/hw_aux_smph.h>
#include <inc/hw_aux_evctl.h>
#include <inc/hw_aux_aiodio.h>
#include <inc/hw_aux_timer.h>
#include <inc/hw_aux_wuc.h>
#include <inc/hw_event.h>
#include <inc/hw_ints.h>
#include <inc/hw_ioc.h>
#include <string.h>
#if defined(__IAR_SYSTEMS_ICC__)
    #include <intrinsics.h>
#endif


// OSAL function prototypes
uint32_t scifOsalEnterCriticalSection(void);
void scifOsalLeaveCriticalSection(uint32_t key);




/// Firmware image to be uploaded to the AUX RAM
static const uint16_t pAuxRamImage[] = {
    /*0x0000*/ 0x1408, 0x040C, 0x1408, 0x042C, 0x1408, 0x0447, 0x1408, 0x044D, 0x4436, 0x2437, 0xAEFE, 0xADB7, 0x6442, 0x7000, 0x7C6B, 0x6870,
    /*0x0020*/ 0x0068, 0x1425, 0x6871, 0x0069, 0x1425, 0x6872, 0x006A, 0x1425, 0x786B, 0xF801, 0xFA01, 0xBEF2, 0x786E, 0x6870, 0xFD0E, 0x6872,
    /*0x0040*/ 0xED92, 0xFD06, 0x7C6E, 0x642D, 0x0451, 0x786B, 0x8F1F, 0xED8F, 0xEC01, 0xBE01, 0xADB7, 0x8DB7, 0x6630, 0x6542, 0x0000, 0x186E,
    /*0x0060*/ 0x9D88, 0x9C01, 0xB60D, 0x1067, 0xAF19, 0xAA00, 0xB609, 0xA8FF, 0xAF39, 0xBE06, 0x0C6B, 0x8869, 0x8F08, 0xFD47, 0x9DB7, 0x086B,
    /*0x0080*/ 0x8801, 0x8A01, 0xBEEC, 0x262F, 0xAEFE, 0x4630, 0x0451, 0x5527, 0x6642, 0x0000, 0x0C6B, 0x140B, 0x0451, 0x6742, 0x86FF, 0x03FF,
    /*0x00A0*/ 0x0C6D, 0x786C, 0xCD47, 0x686D, 0xCD06, 0xB605, 0x0000, 0x0C6C, 0x7C6F, 0x652D, 0x0C6D, 0x786D, 0xF801, 0xE92B, 0xFD0E, 0xBE01,
    /*0x00C0*/ 0x6436, 0xBDB7, 0x241A, 0xA6FE, 0xADB7, 0x641A, 0xADB7, 0x0000, 0x0181, 0x0182, 0x0184, 0x0000, 0x0000, 0xFFFF, 0x0000, 0x0000,
    /*0x00E0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0016, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0100*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0120*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0140*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0160*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0180*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x01A0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x01C0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x01E0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0200*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0220*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0240*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0260*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0280*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x02A0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x02C0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x02E0*/ 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000,
    /*0x0300*/ 0x0000, 0xADB7, 0x1585, 0xADB7, 0xADB7, 0x5000, 0x2877, 0x0A80, 0xCDB1, 0x9DB7, 0x0A7F, 0xCDB1, 0x9DB7, 0x0A80, 0xCDB1, 0x9DB7,
    /*0x0320*/ 0x0A81, 0xCDB1, 0x8DB7, 0x0A82, 0x3513, 0x9DB7, 0x68F9, 0x197B, 0x9D2E, 0xB604, 0x9878, 0xEF09, 0x119F, 0x1E7F, 0xADB7, 0x0A82,
    /*0x0340*/ 0x3513, 0x9DB7, 0x8600, 0xEAFF, 0x9E03, 0x86FF, 0xE800, 0x8E04, 0x540F, 0x7008, 0x11AD, 0x1E7F, 0xADB7, 0x0A82, 0x3513, 0x9DB7,
    /*0x0360*/ 0xEC01, 0xBE02, 0x540F, 0x8E01, 0x740F, 0xEDA9, 0xF8FF, 0xBE02, 0x11BB, 0x1E7F, 0xADB7, 0x0A82, 0x3513, 0x9DB7, 0x1193, 0x1E7F,
    /*0x0380*/ 0x740F, 0x197B, 0x9801, 0x8600, 0x9A80, 0xAE01, 0x1000, 0x1D7B, 0xADB7, 0xDA00, 0x9E08, 0xD8FF, 0xBE06, 0x8608, 0xC200, 0xCF2B,
    /*0x03A0*/ 0x197C, 0x9202, 0x1D7C, 0x097F, 0x1980, 0x8D29, 0x9E0B, 0xAA00, 0xB605, 0xA8FF, 0x3513, 0xAE01, 0x2877, 0xADB7, 0x8602, 0x1278,
    /*0x03C0*/ 0x1E82, 0x0D80, 0xADB7, 0x8602, 0x1277, 0x1E82, 0x5008, 0x4000, 0x397A, 0x8600, 0xB8FA, 0x11EE, 0x1E80, 0xADB7, 0xCDA9, 0x11F2,
    /*0x03E0*/ 0x1E80, 0xADB7, 0xFD47, 0x3513, 0xA601, 0xC280, 0xD8FF, 0xBE02, 0x11FD, 0x8E01, 0x11EE, 0x1E80, 0xADB7, 0x597A, 0xD801, 0x8600,
    /*0x0400*/ 0xDA80, 0xAE01, 0x5000, 0x8602, 0x0207, 0x0E80, 0xADB7, 0xFD47, 0x3513, 0xAE0B, 0xCCFF, 0xBE03, 0x8602, 0xC200, 0x8E02, 0x8601,
    /*0x0420*/ 0xC200, 0x197C, 0x9204, 0x1D7C, 0xADB7, 0x01C9, 0x0E80, 0x8602, 0x0278, 0x0E82, 0x08F8, 0xDD28, 0xBE05, 0x8604, 0xC200, 0xCF2B,
    /*0x0440*/ 0x5876, 0xADB7, 0xCF2B, 0x5D7A, 0x5876, 0xADB7, 0x0A82, 0x3513, 0x9DB7, 0x197E, 0x9A00, 0xB601, 0xADB7, 0x197F, 0x9A00, 0xBE09,
    /*0x0460*/ 0x8602, 0x1277, 0x1E82, 0x11C9, 0x1E80, 0x5000, 0x2877, 0x5D80, 0x0587, 0x8602, 0x123D, 0x1E81, 0x0587, 0x0A82, 0x3513, 0x9DB7,
    /*0x0480*/ 0x097A, 0x18F8, 0x8D19, 0xD602, 0x8600, 0x8880, 0x1874, 0x8D29, 0xAE03, 0x097C, 0x8201, 0x0D7C, 0x8602, 0x124F, 0x8EEC, 0x0A82,
    /*0x04A0*/ 0x3513, 0x9DB7, 0x08F9, 0x197B, 0x8D19, 0xD602, 0x8600, 0x8880, 0x1875, 0x8D29, 0x9603, 0x097C, 0x8208, 0x0D7C, 0x8602, 0x1261,
    /*0x04C0*/ 0x8EDA, 0x0A82, 0x3513, 0x9DB7, 0x097C, 0x1873, 0x8D31, 0xB60A, 0x197D, 0x9A00, 0xBE07, 0x0D7D, 0x652D, 0x0000, 0x0D7C, 0x8602,
    /*0x04E0*/ 0x1226, 0x8EC9, 0x8006, 0x0D7C, 0x8602, 0x1226, 0x8EC4, 0x8E04, 0xAE03, 0x01E3, 0x0E80, 0xADB7, 0xFD47, 0xFD47, 0xADB7, 0x0193,
    /*0x0500*/ 0x01C9, 0x0226, 0x0277
};


/// Look-up table that converts from AUX I/O index to MCU IOCFG offset
static const uint8_t pAuxIoIndexToMcuIocfgOffsetLut[] = {
    120, 116, 112, 108, 104, 100, 96, 92, 28, 24, 20, 16, 12, 8, 4, 0
};


/** \brief Look-up table of data structure information for each task
  *
  * There is one entry per data structure (\c cfg, \c input, \c output and \c state) per task:
  * - [31:24] Data structure size (number of 16-bit words)
  * - [23:16] Buffer count (when 2+, first data structure is preceded by buffering control variables)
  * - [15:0] Address of the first data structure
  */
static const uint32_t pScifTaskDataStructInfoLut[] = {
//  cfg         input       output      state
    0x050100E6, 0x820100F0, 0x820101F4, 0x050102F8  // UART Emulator
};




// No task-specific initialization functions




// No task-specific uninitialization functions




/** \brief Initilializes task resource hardware dependencies
  *
  * This function is called by the internal driver initialization function, \ref scifInit().
  */
static void scifTaskResourceInit(void) {
    scifInitIo(12, AUXIOMODE_OUTPUT, 1, 1);
    scifInitIo(13, AUXIOMODE_INPUT,  1, 0);
} // scifTaskResourceInit




