tjd61/cc2650_simplelink_ble/ti/simplelink_academy_01_11_00_0000/modules/projects/support_files/Components/SCIF_UART/scif.c
/** \brief Uninitilializes task resource hardware dependencies
  *
  * This function is called by the internal driver uninitialization function, \ref scifUninit().
  */
static void scifTaskResourceUninit(void) {
    scifUninitIo(12, 1);
    scifUninitIo(13, 1);
} // scifTaskResourceUninit




/// Driver setup data, to be used in the call to \ref scifInit()
const SCIF_DATA_T scifDriverSetup = {
    (volatile SCIF_TASK_CTRL_T*) 0x400E00DC,
    (volatile uint16_t*) 0x400E00CE,
    0x0000,
    sizeof(pAuxRamImage),
    pAuxRamImage,
    pScifTaskDataStructInfoLut,
    pAuxIoIndexToMcuIocfgOffsetLut,
    scifTaskResourceInit,
    scifTaskResourceUninit
};




/** \brief Sets the RX byte timeout
  *
  * The RX timeout starts once a byte has been received. The last received byte is flagged (see
  * \ref scifUartRxGetChar()) when the UART RX line has been idle for the specified period of time.
  *
  * \note This function must only be called while the UART receiver is disabled!
  *
  * \param[in]      rxTimeout
  *     Timeout in half bit periods
  */
void scifUartSetRxTimeout(uint16_t rxTimeout) {
    scifTaskData.uartEmulator.cfg.rxByteTimeout = rxTimeout;
} // scifUartSetRxTimeout




/** \brief Sets the number of required idle periods when enabling the UART receiver
  *
  * To prevent enabling RX in the middle of a byte and receiving garbage data, the required idle count
  * should be set to 20 (or more). After calling \c scifUartRxEnable(1), start bit detection is enabled
  * once the RX line has been idle (high) for the specified period of time
  *
  * \note This function must only be called while the UART receiver is disabled!
  *
  * \param[in]      rxEnableReqIdleCount
  *     Required idle time in number of half bit periods
  */
void scifUartSetRxEnableReqIdleCount(uint16_t rxEnableReqIdleCount) {
    scifTaskData.uartEmulator.cfg.rxEnableReqIdleCount = rxEnableReqIdleCount;
} // scifUartSetRxEnableReqIdleCount




/** \brief Enables or disables the UART receiver
  *
  * When enabling, the UART begins detecting start bit after the configurable required idle period (see
  * \ref scifUartSetRxEnableReqIdleCount()).
  *
  * When disabling, the UART receiver will be deactivated within one bit-period. Any ongoing byte
  * reception is aborted. Note that this also prevents RX timeout for the last received byte.
  *
  * \param[in]      rxEnable
  *     True to enable RX, false to disable RX
  */
void scifUartRxEnable(uint16_t rxEnable) {
    scifTaskData.uartEmulator.state.rxEnable = rxEnable;
} // scifUartRxEnable




/** \brief Stops the UART emulator
  *
  * When running the UART emulation task, the execution code runs continuously, and can only be stopped
  * by calling this function. This stops the UART emulator within one bit period.
  *
  * \note This function must only be called while the UART baud generator is active, and baud rate
  *       generation must not be disabled until the stop operation has taken effect.
  */
void scifUartStopEmulator(void) {
    scifTaskData.uartEmulator.state.exit = 1;
} // scifUartStopEmulator




/** \brief Sets the UART baud rate
  *
  * This function must be called to start baud rate generation before or after starting the UART
  * emulation task. This function can be called during operation to change the baud rate on-the-fly.
  *
  * \param[in]      baudRate
  *     The new baud rate (e.g. 115200 or 9600)
  */
void scifUartSetBaudRate(uint32_t baudRate) {
    uint32_t t0Period;
    uint32_t t0PrescalerExp;

    // Start baud tate generation?
    if (baudRate) {

        // Calculate the AUX timer 0 period
        t0Period = 24000000 / (4 * baudRate);

        // The period must be 256 clock cycles or less, so up the prescaler until it is
        t0PrescalerExp = 0;
        while (t0Period > 256) {
            t0PrescalerExp += 1;
            t0Period >>= 1;
        }

        // Stop baud rate generation while reconfiguring
        HWREG(AUX_TIMER_BASE + AUX_TIMER_O_T0CTL) = 0;

        // Set period and prescaler, and select reload mode
        HWREG(AUX_TIMER_BASE + AUX_TIMER_O_T0CFG) = (t0PrescalerExp << AUX_TIMER_T0CFG_PRE_S) | AUX_TIMER_T0CFG_RELOAD_M;
        HWREG(AUX_TIMER_BASE + AUX_TIMER_O_T0TARGET) = t0Period - 1;

        // Start baud rate generation
        HWREG(AUX_TIMER_BASE + AUX_TIMER_O_T0CTL) = 1;

    // Baud rate 0 -> stop baud rate generation
    } else {
        HWREG(AUX_TIMER_BASE + AUX_TIMER_O_T0CTL) = 0;
    }

} // scifUartSetBaudRate




/** \brief Calculates the number of bytes currently stored in the RX FIFO
  *
  * Note that the RX FIFO can only store the configured number of characters minus one. This number is
  * defined by \ref SCIF_UART_RX_FIFO_MAX_COUNT.
  *
  * \return
  *     The number of characters in the RX FIFO, ready to be read
  */
uint32_t scifUartGetRxFifoCount(void) {
    uint16_t rxTail = scifTaskData.uartEmulator.input.rxTail;
    uint16_t rxHead = scifTaskData.uartEmulator.output.rxHead;
    if (rxHead < rxTail) {
        rxHead += sizeof(scifTaskData.uartEmulator.output.pRxBuffer) / sizeof(uint16_t);
    }
    return rxHead - rxTail;
} // scifUartGetRxFifoCount




/** \brief Receives a single character, with flags
  *
  * This function must only be called when there is at least one character in the RX FIFO. Calling this
  * function when the FIFO is empty will cause underflow, without warning.
  *
  * \return
  *     The received character, with flags:
  *     - [15:12] - Reserved
  *     - [11] - RX timeout occurred after receiving this character
  *     - [10] - RX FIFO ran full when receiving this character (this character may be invalid)
  *     - [9] - Break occurred when receiving this character
  *     - [8] - Framing error occurred when receiving this character
  *     - [7:0] - The character value
  */
uint16_t scifUartRxGetChar(void) {

