tjd61/cc2650_simplelink_ble/ti/simplelink_academy_01_11_00_0000/modules/projects/support_files/Components/SCIF_UART/scif.c
    // Get the character
    uint32_t rxTail = scifTaskData.uartEmulator.input.rxTail;
    uint16_t c = scifTaskData.uartEmulator.output.pRxBuffer[rxTail];

    // Update the TX FIFO head index
    if (++rxTail == (sizeof(scifTaskData.uartEmulator.output.pRxBuffer) / sizeof(uint16_t))) {
        rxTail = 0;
    }
    scifTaskData.uartEmulator.input.rxTail = (uint16_t) rxTail;

    return c;
} // scifUartRxGetChar




/** \brief Receives the specified number of character, without flags
  *
  * This function must only be called with count equal to or less than the current RX FIFO count. Calling
  * this function with too high count will cause underflow, without warning.
  *
  * \param[in,out]  *pBuffer
  *     Pointer to the character destination buffer
  * \param[in]      count
  *     Number of characters to get
  */
void scifUartRxGetChars(char* pBuffer, uint32_t count) {
    int n;

    // For each character ...
    uint32_t rxTail = scifTaskData.uartEmulator.input.rxTail;
    for (n = 0; n < count; n++) {

        // Get it
        pBuffer[n] = (char) scifTaskData.uartEmulator.output.pRxBuffer[rxTail];

        // Update the TX FIFO head index
        if (++rxTail == (sizeof(scifTaskData.uartEmulator.output.pRxBuffer) / sizeof(uint16_t))) {
            rxTail = 0;
        }
    }
    scifTaskData.uartEmulator.input.rxTail = (uint16_t) rxTail;

} // scifUartRxGetChars




/** \brief Receives the specified number of character, with flags
  *
  * This function must only be called with count equal to or less than the current RX FIFO count. Calling
  * this function with too high count will cause underflow, without warning.
  *
  * \param[in,out]  *pBuffer
  *     Pointer to the character destination buffer. Each entry contains the following
  *     - [15:12] - Reserved
  *     - [11] - RX timeout occurred after receiving this character
  *     - [10] - RX FIFO ran full when receiving this character (this character may be invalid)
  *     - [9] - Break occurred when receiving this character
  *     - [8] - Framing error occurred when receiving this character
  *     - [7:0] - The character value
  * \param[in]      count
  *     Number of characters to get
  */
void scifUartRxGetCharsWithFlags(uint16_t* pBuffer, uint32_t count) {
    int n;

    // For each character ...
    uint32_t rxTail = scifTaskData.uartEmulator.input.rxTail;
    for (n = 0; n < count; n++) {

        // Get it
        pBuffer[n] = scifTaskData.uartEmulator.output.pRxBuffer[rxTail];

        // Update the TX FIFO head index
        if (++rxTail == (sizeof(scifTaskData.uartEmulator.output.pRxBuffer) / sizeof(uint16_t))) {
            rxTail = 0;
        }
    }
    scifTaskData.uartEmulator.input.rxTail = (uint16_t) rxTail;

} // scifUartRxGetCharsWithFlags




/** \brief Calculates the number of bytes currently stored in the TX FIFO
  *
  * The count is decremented when a character's stop bits are transmitted.
  *
  * Note that the TX FIFO can only store the configured number of characters minus one. This number is
  * defined by \ref SCIF_UART_TX_FIFO_MAX_COUNT.
  *
  * \return
  *     The number of characters in the TX FIFO, waiting to be transmitted
  */
uint32_t scifUartGetTxFifoCount(void) {
    uint16_t txTail = scifTaskData.uartEmulator.output.txTail;
    uint16_t txHead = scifTaskData.uartEmulator.input.txHead;
    if (txHead < txTail) {
        txHead += sizeof(scifTaskData.uartEmulator.input.pTxBuffer) / sizeof(uint16_t);
    }
    return txHead - txTail;
} // scifUartGetTxFifoCount




/** \brief Transmits a single character, without delay
  *
  * This function must not be called when the TX FIFO is full. Calling this function when the FIFO is
  * full will cause overflow, without warning. The number of free entries in the FIFO is:
  * \code
  * SCIF_UART_TX_FIFO_MAX_COUNT - scifUartGetTxFifoCount()
  * \endcode
  *
  * \param[in]      c
  *     The character to transmit
  */
void scifUartTxPutChar(char c) {

    // Put the character
    uint32_t txHead = scifTaskData.uartEmulator.input.txHead;
    scifTaskData.uartEmulator.input.pTxBuffer[txHead] = c;

    // Update the TX FIFO head index
    if (++txHead == (sizeof(scifTaskData.uartEmulator.input.pTxBuffer) / sizeof(uint16_t))) {
        txHead = 0;
    }
    scifTaskData.uartEmulator.input.txHead = (uint16_t) txHead;

} // scifUartTxPutChar




/** \brief Transmits a single character, after the specified delay
  *
  * This function must not be called when the TX FIFO is full. Calling this function when the FIFO is
  * full will cause overflow, without warning. The number of free entries in the FIFO is:
  * \code
  * SCIF_UART_TX_FIFO_MAX_COUNT - scifUartGetTxFifoCount()
  * \endcode
  *
  * \param[in]      c
  *     The character to transmit
  * \param[in]      delay
  *     Delay inserted before this character is transmitted, given in number of bits
  */
void scifUartTxPutCharDelayed(char c, uint8_t delay) {

    // Put the character, with delay
    uint32_t txHead = scifTaskData.uartEmulator.input.txHead;
    scifTaskData.uartEmulator.input.pTxBuffer[txHead] = (delay << 8) | c;

    // Update the TX FIFO head index
    if (++txHead == (sizeof(scifTaskData.uartEmulator.input.pTxBuffer) / sizeof(uint16_t))) {
        txHead = 0;
    }
    scifTaskData.uartEmulator.input.txHead = (uint16_t) txHead;

} // scifUartTxPutCharDelayed




/** \brief Transmits the specified number of character
  *
  * This function must not be called with count higher than the number of free entries in the TX FIFO.
  * Calling this function with too high count will cause overflow, without warning. The number of free
  * entries in the FIFO is:
  * \code
  * SCIF_UART_TX_FIFO_MAX_COUNT - scifUartGetTxFifoCount()
  * \endcode
  *
  * \param[in,out]  *pBuffer
  *     Pointer to the character source buffer
  * \param[in]      count
  *     Number of characters to put
  */
void scifUartTxPutChars(char* pBuffer, uint32_t count) {
    int n;

    // For each character ...
    uint32_t txHead = scifTaskData.uartEmulator.input.txHead;
    for (n = 0; n < count; n++) {

        // Get it
        scifTaskData.uartEmulator.input.pTxBuffer[txHead] = pBuffer[n];

        // Update the TX FIFO head index
        if (++txHead == (sizeof(scifTaskData.uartEmulator.input.pTxBuffer) / sizeof(uint16_t))) {
            txHead = 0;
        }
    }
    scifTaskData.uartEmulator.input.txHead = (uint16_t) txHead;

} // scifUartTxPutChars




