tjd61/cc2650_simplelink_ble/ti/simplelink_academy_01_11_00_0000/modules/projects/support_files/Components/SCIF_UART/scif.c
/** \brief Returns the SCIF UART events that had occurred when the last ALERT interrupt was generated
  *
  * This function does not return any new events until \ref scifUartClearEvents() has been called. Events
  * that have occurred in the meantime are stored in a backlog.
  *
  * The reported events include the events excluded in the call to \ref scifUartSetEventMask().
  *
  * \return
  *     Bit-vector of the events that have occurred (one or more of the following):
  *     - \ref BV_SCIF_UART_ALERT_RX_FIFO_ABOVE_THR
  *     - \ref BV_SCIF_UART_ALERT_RX_BYTE_TIMEOUT
  *     - \ref BV_SCIF_UART_ALERT_RX_BREAK_OR_FRAMING_ERROR
  *     - \ref BV_SCIF_UART_ALERT_TX_FIFO_BELOW_THR
  */
uint16_t scifUartGetEvents(void) {
    return scifTaskData.uartEmulator.state.alertEvents;
} // scifUartGetEvents




/** \brief Clears the SCIF UART events reported by the last call to \ref scifUartGetEvents()
  *
  * This function must be called to get further event reports through ALERT interrupts.
  */
void scifUartClearEvents(void) {
    scifTaskData.uartEmulator.state.alertEvents = 0x0000;
} // scifUartClearEvents




/** \brief Select which SCIF UART events that shall trigger the ALERT interrupt
  *
  * The ALERT interrupt is generated when one or more of the events included in the mask occur.
  *
  * \param[in]      mask
  *     Bit-vector of the events that shall generate the ALERT interrupt (zero or more of the following):
  *     - \ref BV_SCIF_UART_ALERT_RX_FIFO_ABOVE_THR
  *     - \ref BV_SCIF_UART_ALERT_RX_BYTE_TIMEOUT
  *     - \ref BV_SCIF_UART_ALERT_RX_BREAK_OR_FRAMING_ERROR
  *     - \ref BV_SCIF_UART_ALERT_TX_FIFO_BELOW_THR
  */
void scifUartSetEventMask(uint16_t mask) {
    scifTaskData.uartEmulator.cfg.alertMask = mask;
} // scifUartSetEventMask


//@}
